<template>
    <div class="main-content-index-pages">

        <section class="parallax-section policy">
            <div class="overlay"></div>
            <div class="container">
                <div class="row">
                    <div class="  col-md-12 col-sm-12">
                        <h3 class="text-right">قوانین استفاده از اینکوباک</h3>
                        <div class="  col-md-12 col-sm-12">
                            <p class="text-right">با توجه به تحقیقات و مطالعات صورت گرفته در بازار و حضور در نمایشگاه های داخلی و بین المللی حوزه محصولات کشاورزی و سابقه ی حضور در بازار صادرات ایران شاهد مشکلات عدیده‌ای از قبیل : عدم دسترسی مناسب به محصولات با کیفیت، فقدان شبکه دسترسی برای قیمت‌گذاری، وجود واسطه های بسیار زیاد و افزایش قیمت در تبع آن و هدر رفت سرمایه بودیم. لذا برآن شدیم تا با ایجاد ساختاری تکنولوژی محور در راستای حل و تسهیل این مشکلات گام برداریم.
                            </p>
                            <br/>
                            <p>
                                از آنجا که ما خود بخش کوچکی از خانواده ی کشاورزی ایران هستیم، عزم کامل خود را برای ریشه کن کردن مشکلات دسترسی تولید کنندگان و خریداران محصولات خام کشاورزی به یکدیگر جزم کرده ایم و تا زمانی که این هدف محقق نشود دست از تلاش شبانه روزی خود بر نخواهیم داشت.
                            </p>
                            <br/>
                            <p class="text-right">اینکوباک، بازارگاه آنلاین محصولات کشاورزی با هدف گردهم آوردن بهترین تولیدکنندگان و بازرگانان حوزه کشاورزی در جهت افزایش بهره‌وری شروع به کار کرد. در این راستا اینکوباک خدمات زیر را ارائه می‌دهد :</p>
                            <br/>
                            <ul class="text-right">
                                <li>ایجاد پروفایل تجاری در فضایی کاملاً حرفه‌ای</li>
                                <li>امکان بازدید و ایجاد نمایشگاه مجازی رایگان</li>
                                <li>امکان ثبت درخواست خرید و فروش محصولات خود</li>
                                <li>دسترسی آسان به تامین کنندگان محصولات مختلف در اقصی نقاط ایران</li>
                                <li>امکان مقایسه کیفیت و قیمت محصولات</li>
                                <li>ارسال پیام مستقیم به تامین کنندگان و خریداران</li>
                            </ul>
                            <br/>
                            <p class="text-right">
                                ما به دلیل مشکلات امنیتی ایجاد شده به علت نمایش شماره تماس افراد و همچنین نقض حریم خصوصی افراد، از نمایش این اطلاعات اجتناب کرده ایم. لذا افراد میتوانند از طریق پیام رسان اینکوباک در صورت تمایل اطلاعات تماس خود را ردوبدل کنند.
                            </p>
                            <br/>
                            <p class="test-right">
                                استفاده از تمام امکانات سایت برای تامین کنندگان و خریداران رایگان است.
                            </p>
                            <br/>
                            <p class="text-right">
                                سوالات، انتقادات و پیشنهادات خود را از طریق آدرس ایمیل support@incobac.com با ما در میان بگذارید.
                            </p>
                        </div>
                    </div>
                </div>
            </div>
        </section>


    </div>
</template>

<script>
    import {eventBus} from "../../../router/dashboard_router";

    export default {
        methods:{
            loader:function(){
                console.log('is loader');
                this.$nextTick(function () {
                    eventBus.$emit('finishLoad', false);
                });
            }
        },
        mounted:function(){
            this.loader();
        },
        updated: function () {
            this.loader();
        }
    }
</script>
