<style scoped>
p,
span,
div,
h3 {
  line-height: 1.618;
}
</style>
<template>
  <div class="main-content-index-pages">
    <section class="parallax-section policy">
      <div class="overlay"></div>
      <div class="container">
        <div class="col-md-12 col-sm-12">
          <h3 class="text-right">قوانین استفاده از باسکول</h3>
          <p class="text-right">
            باسکول، بستر تجاری آنلاین است که از طریق آن هر کاربر ثبت شده می
            تواند برای برقراری و توسعه کسب و کار با دیگر تولید کنندگان و
            خریداران همکاری کند. شرایط و مقررات تشکیل شده در این صفحه مشخص می
            کند که چگونه باید وب سایت و خدمات مورد استفاده قرار گیرد و نهایتا
            روابط فی مابین باسکول و کاربران (ثبت شده یا ثبت نشده) را تنظیم می
            کند. لطفاً شرایط و مقررات حاضر را به دقت مطالعه کنید و در صورتی که
            قوانین وب سایت برای شما قابل قبول نیست استفاده خود را از وب سایت و
            یا خدمات باسکول به هر نحو متوقف کنید. در استفاده از خدمات وب سایت
            باسکول فرض بر این است که عملاً این شرایط و مقررات و تغییرات بعدی آن
            را پذیرفته اید، در این صورت هیچ ادعایی ناشی از استفاده مداوم شما از
            این سایت و ادعای عدم مطالعه یا آگاهی شما از این مقررات و تغییرات
            بعدی ترتیب اثر داده نخواهد شد. شرایط درج آگهی در سامانه باسکول:
          </p>
          <ul class="text-right">
            <li>
              آگهی ها باید زیر مجموعه حوزه کشاورزی و دسته بندی های موجود در
              وبسایت باشند.
            </li>
            <li>
              عدم مغایرت با قوانین جمهوری اسلامی ایران، ناقض حریم خصوصی افراد ،
              فاقد هرگونه توهین به ادیان رسمی کشور، آداب، رسوم، قومیت‌ها،
              لهجه‌ها و گویش‌های مختلف
            </li>
            <li>
              عدم درج کالاهای ممنوعه مانند : ماریجوانا و مواد مخدر گیاهی و یا
              بذر و دانه آنها
            </li>
            <li>
              عدم درخواست کمک‌های نقدی یا پیش‌پرداخت برای معامله‌های از راه دور
              و عدم درج شماره حساب در متن آگهی
            </li>
            <li>نبود جملات نادرست از نظر املائی یا نگارشی در آگهی</li>
          </ul>
          <p>
            به منظور بهبود فرآیند تأیید و انتشار آگهی‌ها، سامانه باسکول ممکن است
            در مواردی بر اساس قوانین، متن یا آگهی شما را به طور جزئی تغییر دهد.
            مسئولیت استفاده از آگهی‌های این سایت بر عهده شماست و باسکول هیچ
            تعهدى در قبال خسارات مستقیم، اتفاقى، تبعى، غیرمستقیم و کیفرى، ناشى
            از دسترسى و استفاده شما از این سایت را ندارد. باسکول هیچ قرارداد،
            تعهدنامه یا سندی را با آگهی‌دهندگان حقیقی یا حقوقی منعقد نمی‌کند.
            کاربران باسکول در هر لحظه قادر به ویرایش آگهی خود هستند، بنابراین
            باسکول، هیچ‌گونه مسئولیتی را در قبال هر نوع آگهی درج شده در سایت
            نمی‌پذیرد و صرفاً مطالب درج شده توسط کاربران را نمایش می‌دهد.
            مسئولیت استفاده از هرگونه متن، پیام، توضیح، اطلاعات، تصویر، مشخصات
            تماس و موارد مشابه که به باسکول جهت درج آگهی ارسال می‌شود یا در آن
            قرار می‌گیرد، شامل بازتولید، افشاء، مخابره، نشر و پخش آن بر عهده
            فرستنده اطلاعات است
          </p>
        </div>
        <div class="col-md-12 col-sm-12">
          <h3 class="text-right">قوانین استفاده از چت باسکول</h3>
          <p class="text-right">
            چت باسکول یک فضای ارتباطی عمومی بین اعضای باسکول است که با هدف تسهیل
            ارتباط و معاملات ارائه شده‌ است. هرگونه استفاده از چت باسکول به معنی
            پذیرفتن ضوابط و شرایط ذیل است:
          </p>
          <ul class="text-right">
            <li>
              مکاتبات کاربران از طریق چت باسکول باید مربوط به آگهی خاص و در خصوص
              ارائه و یا دریافت کالا و خدمات مورد اشاره باشد و استفاده از آن
              بابت مقاصد دیگر از جمله ارتباطات خصوصی مجاز نیست.
            </li>
            <li>
              استفاده از چت باسکول صرفاً باید مربوط به معاملات باشد و باسکول
              ممکن است برای ایجاد محیطی ایمن و جلوگیری از سوءاستفاده و مزاحمت،
              در صورت لزوم بر مکاتبات، نظارت ماشینی یا انسانی انجام دهد.
            </li>
            <li>
              مواردی از قبیل ارسال پیام و محتواهای غیراخلاقی یا نامربوط به
              معامله، استفاده از ادبیات غیرمؤدبانه، انجام هرگونه تبلیغات، ارائه
              اجناس و خدماتی که خلاف شرایط و قوانین هستند و همچنین ارسال
              پیام‌های انبوه، در صورتی که توسط کاربران گزارش شوند، مورد بررسی
              قرار گرفته و طبق قوانین باسکول ممکن است منجر به تعلیق یا مسدود شدن
              دائمی کاربر متخلف شود.
            </li>
            <li>
              تعلیق کاربر حالتی است که کاربر براساس گزارش کاربران دیگر درباره
              تخلف او، به مدت محدودی امکان استفاده از چت باسکول را ندارد. این
              مدت ممکن است یک، سه، هفت یا سی روز بوده و در صورت تکرار تخلف، این
              مدت تمدید گردد.
            </li>
            <li>
              مسدود شدن کاربر حالتی است که کاربر با توجه به نوع تخلف مشمول جریمه
              عدم امکان استفاده از چت باسکول بطور کلی خواهد بود.
            </li>
            <li>
              تعلیق شدن یا مسدود شدن کاربر به فراخور تخلف صورت گرفته و به تشخیص
              کارشناسان باسکول صورت می‌گیرد.
            </li>
            <li>
              لازم است کاربران هنگام باز کردن لینک‌های ارسال شده توسط کاربران
              دیگر احتیاط لازم را انجام دهند تا در معرض خطرات فیشینگ و
              کلاهبرداری‌های اینترنتی قرار نگیرند. باسکول هیچ گونه مسئولیتی در
              قبال وقوع فیشینگ و کلاهبرداری‌های اینترنتی توسط کاربران ندارد.
            </li>
            <li>
              هم‌چنین توصیه همیشگی باسکول به کاربران این است که از ارسال اطلاعات
              شخصی و خصوصی خود که برای انجام معامله غیرضروری هستند، خودداری
              کنید.
            </li>
            <li>
              در صورتی که کاربری، شما را مسدود نموده و یا آگهی خود را از باسکول
              حذف نماید، اطلاعات تماس او جزو حریم خصوصی وی محسوب شده و باسکول
              اجازه ندارد تا اطلاعات تماس وی را در اختیار کاربران دیگر قرار دهد.
              لذا لطفاً از انجام هرگونه توافق ناظر بر پرداخت وجه از طریق چت
              باسکول یا پرداخت وجه بدون اطمینان یافتن از دریافت جنس خودداری
              نمایید؛ و یا حتما از دریافت اطلاعات تماس معتبر جهت پیگیری معامله و
              توافقات یکدیگر قبل از حذف آگهی مطمئن شوید بدیهی است که در صورت
              وقوع کلاهبرداری یا سایر جرایم از طریق چت باسکول ، باسکول
              همکاری‌های لازم را جهت تحقیقات قضایی حسب دستور مقامات قضایی انجام
              خواهد داد.
            </li>
          </ul>
        </div>
      </div>
    </section>
  </div>
</template>

<script>
export default {
  methods: {
    stopLoader: function () {
      this.$store.state.routeStore.isLoading = false;
    },
  },
  mounted: function () {
    this.$nextTick(this.stopLoader());
  },
  updated: function () {
    this.$nextTick(this.stopLoader());
  },
  created() {
    gtag("config", "UA-129398000-1", { page_path: "/privacy-and-policy" });
  },
  metaInfo() {
    return {
      title: " قوانین و مقررات ",
      titleTemplate: "باسکول | %s",
      meta: [
        {
          name: "description",
          content:
            "مرجع تخصصی خرید و فروش عمده و قیمت محصولات کشاورزی ایران | صادرات محصولات کشاورزی",
        },
        {
          name: "author",
          content: "باسکول",
        },
        {
          property: "og:description",
          content:
            "مرجع تخصصی خرید و فروش عمده و قیمت محصولات کشاورزی ایران | صادرات محصولات کشاورزی",
        },
        {
          property: "og:site_name",
          content: "باسکول بازارآنلاین خرید و فروش عمده محصولات کشاورزی ایران",
        },
        {
          property: "og:title",
          content: " باسکول | بازار خرید و فروش عمده محصولات کشاورزی ",
        },
      ],
    };
  },
};
</script>
