@extends('layout.buyer-dashboard')

@section('header_links')
    <link type="text/css" rel="stylesheet" href="{{asset('assets/css/dashboard/buyer/transaction-report-detail.css')}}">
@endsection

@section('sub_header')
    <div class="sub-header">
        <ul class="list-inline">
            <li class="list-item">
                <a href="#" class="active">
                لیست تراکنش ها    
                </a>
            </li>

        </ul>
    </div>
@endsection


@section('main_content')
<main id="main">
    <section class="main-content col-xs-12">
        <!--part 1-->
        <div id="step1" v-if="currentStep == 1">
            <div class="contents col-xs-12">
                <div class="buttons">
                    <div class="main_buttons col-xs-12">
                        <a href="#" class="default_btn" @click.prevent="goToNextPage()">صفحه بعد</a>
                        <a href="#" class="default_btn" @click.prevent="goToPrePage()">صفحه قبل</a>
                    </div>
                </div>
                <h2>عنوان قرارداد</h2>
                <p id="step1S1" v-if="pageStep == 1">
                        <span> با هدف تنظیم روابط اطراف قرارداد، قرارداد حاضر ذیل ماده ۱۰ قانون مدنی و با حاکم قرار دادن اصل حسن نیت بین طرفین منعقد می گردد.</span><br/><br/>
                       
                        <span><b> ماده 1 :طرفین قرارداد</b></span><br/><br/>
                       
                        <span>1-1طرف اول: شرکت سهامی خاص فناوران توسعه تجارت ارم به شماره ثبت</span><br/>
                        <span>1-2 طرف دوم: هر شخص حقیقی یا حقوقی به نام</span>
                       <br/><br/>
                       
                       <span><b> ماده 2 :موضوع قرارداد</b></span><br/><br/>
                       <span>2-1  تنظیم همکاری و روابط قراردادی طرفین در خصوص همکاری اینکوباک با خریدار جهت خرید کالا و محصولات فروشنده از طریق وبسایت ایجاد شده توسط اینکوباک به نشانی incobac.com .بدیهی است با توجه به اینکه مالکیت محصولات ارائه شده در سایت متعلق به اینکوباک نبوده و اینکوباک صرفاً ارائه دهنده بستر اینترنتی جهت فروش محصولات فوق می باشد لذا مسئولیت کلیه اوصاف محصول اعم از نوع، بسته بندی، قیمت و هرگونه اطلاعات ذکر شده در رابطه با محصول بر عهده فروشنده است.
                       </span><br/><br/>
                       <span>2-2 اینکوباک بر اساس اطلاعات ذکر شده در سایت اقدام به صدور فاکتور برای طرفین می نماید که این فاکتور در اختیار طرفین قرار می گیرد و مبنای رسیدگی به کلیه اختلافات حاصله،  قرارداد حاضر و فاکتور مذکور می باشد.</span><br/><br/>
                       <span>2-3 با توجه به شرایط خاص هر معامله، هزینه های مربوط به حمل و نقل و بیمه کالاهای مورد معامله ممکن است بر عهده خریدار یا فروشنده قرار گیرد که این امر در قرارداد حاضر قید و مورد تایید طرف متعهد قرار می گیرد در هر صورت اینکوباک نسبت به هزینه های فوق الذکر از خود سلب مسئولیت می‌نماید.</span><br/><br/>
                       
                       <span><b>ماده 3 :مکانیسم اجرایی عملیات خرید و فروش</b></span><br/><br/>
                       <span>3-1خریدار و فروشنده با پذیرش قرارداد حاضر می توانند از بستر اینترنتی ارائه شده توسط طرف اول (پلتفرم اینکوباک) جهت سفارش و ارائه محصولات استفاده نمایند.</span><br/>
                    
                    </p>
                    <p id="step1S2" v-if="pageStep == 2">
                        <span>3-2خریدار درخواست خود را از طریق سفارش کالا به صورت الکترونیکی برای اینکوباک ارسال و اینکوباک تقاضای خرید خریدار را از طریق ایمیل یا seller center به فروشندگان مرتبط اعلام می نماید.</span><br/><br/>
                        <span>3-3 چنانچه فروشنده قادر به تامین سفارش خریدار باشد پاسخ خود را با ذکر اوصاف و پیوست تصاویر محصولات ، برای خریدار ارسال می نماید.</span><br/><br/>
                        <span>3-4 چنانچه خریدار پیشنهاد فروشنده را در پنل کاربری خویش پذیرفت، اپراتور های اینکوباک اقدام به برقراری تماس تلفنی و انجام هماهنگی های نهایی  با طرفین نموده و در صورت حصول توافق، متن قرارداد را برای طرفین ارسال می نمایند که ملاک زمانی انعقاد قراداد، زمان تایید الکترونیکی متن قرارداد ارسالی برای طرفین( خریدار و فروشنده) می باشد.</span><br/><br/>
                        <span>3-5: پس از تایید قرارداد توسط طرفین فاکتور پیش پرداخت توسط اینکوباک صادر گردیده و خریدار بایستی ظرف مدت .یک روز نسبت به پرداخت آن اقدام نماید.</span><br/><br/>
                        <span>3-6  در صورت تادیه پیش پرداخت توسط خریدار، فروشنده بایستی ظرف مهلتی که در قرارداد حاضر قید می گردد کالای سفارش داده شده را تهیه و جهت ارسال به متصدی حمل و نقل تسلیم نماید. بدیهی است که کلیه مسؤلیت های ناشی از تامین سفارش و همچنین تحویل کالا به متصدی حمل و نقل قانونی بر عهده فروشنده می باشد. </span><br/><br/>
                        <span>3-7 قبل از تسلیم کالا به متصدی حمل و نقل و انجام عملیات بارگیری، بازرس اینکوباک در محل بارگیری حضور می یابد و کالای سفارش داده شده را از جهت انطباق با مفاد قرارداد حاضر مورد بررسی قرار می دهد.(تعیین موارد و اوصافی که در هر سفارش بایستی توسط بازرس اینکوباک مورد بررسی و تایید قرار گیرد به پیوست قرارداد حاضر در اختیار خریدار و فروشنده قرار خواهد گرفت). بدیهی است که بازرس اینکوباک صرفاً نسبت به بررسی این اوصاف مسئولیت داشته و سایر اوصاف و موارد از حیطه مسئولیت بازرس اینکوباک خارج می باشد.</span><br/><br/>
                        <span>3-8 در صورت تأیید محصولات توسط بازرس، این امر تلفناً به اطلاع خریدار رسیده و فاکتور نهایی قراداد توسط اینکوباک صادر می گردد و خریدار بایستی ظرف مدت 2 ساعت از اتمام بارگیری نسبت به تسویه مبلغ باقی مانده قراداد اقدام نماید که در این صورت محصولات تحویل متصدی حمل و نقل می‌گردد و پس از گذشت یک هفته از پایان تراکنش، اینکوباک پس از کسر کمیسیون خود از معامله ، ثمن معامله را به حساب فروشنده واریز خواهد کرد.</span><br/><br/>
                    </p>
                    <p id="step1S3" v-if="pageStep == 3">
                        <span>3-9 بدیهی است با توجه به عدم مالکیت اینکوباک بر محصولات ارائه شده در بستر اینترنتی، فروش کالا به خریدار نهایی توسط فروشنده انجام می پذیرد و اینکوباک صرفا زیرساخت انجام فروش را فراهم می نماید لذا در صورت صدور فاکتور در وجه اینکوباک و اظهار نمودن آن در گزارشات مالیاتی مراتب مورد تایید این شرکت نبوده و همچنین این شرکت هیچگونه مسئولیتی بر عهده نخواهد داشت و مسئولیت خسارت وارده احتمالی بر عهده متخلف از این بند خواهد بود. </span><br/><br/>
                        <span><b>ماده 4: تعهدات خریدار</b></span><br/><br/>
                        <span>خریدار متعهد می باشد پس از تامین بار توسط فروشنده جهت بارگیری  و تایید نهایی بازرس اینکوباک ، نسبت به تسویه حساب و پرداخت مبلغ فاکتور نهایی  قراداد، حداکثر ظرف مدت 2 ساعت اقدام نماید.  و چنانچه نسبت  به تسویه حساب در زمان مقرر اقدام ننماید ، مبلغ پانصد هزار تومان به انضمام 5 درصد از مبلغ کل معامله  از پیش پرداخت واریزی توسط خریدار به عنوان جریمه  لغو معامله کسر و مابقی مبلغ پیش پرداخت به وی مسترد می گردد. همچنین چنانچه در این خصوص خسارتی به اینکوباک یا فروشنده وارد گردد خریدار متعهد به جبران خسارت خواهد بود که مبلغ خسارت ایجاد شده به انضمام مبالغ جریمه فوق، از پیش پرداخت واریزی توسط خریدار کسر و مابقی به وی مسترد می گردد و تا تعیین تکلیف نهایی در خصوص خسارت مورد ادعا و اجرای رای قطعی مرکز داوری پیش بینی شده در قرارداد، پیش پرداخت واریزی توسط خریدار به عنوان ضمانت اجرای رای داور در حساب بانکی اینکوباک ذکر شده در قرارداد نگهداری می گردد.</span><br/><br/>
                        
                        <span><b>ماده 5: تعهدات و تضمینات فروشنده</b></span><br/><br/>
                        <span>بر اساس شرایط این قرارداد فروشنده موظف به انجام امور ذیل می باشد.</span><br/><br/>
                        <span>5-1 مسئولیت تعیین و درج قیمت کالا ، تولید و درج اطلاعات محصول اعم از کلیه اطلاعات کمی و کیفی محصول و به‌روزرسانی میزان موجودی محصول در وبسایت اینکوباک بر عهده فروشنده می باشد. قیمت‌های مندرج بر روی , وبسایت اینکوباک می‌بایست رقابتی و حداقل برابر با قیمت کالاهای همانند در سایر فروشگاه ها اعم از اینترنتی و غیر اینترنتی باشد</span><br/><br/>
                        <span>تبصره: اینکوباک زیرساخت و ابزار ساخت محتوا را به صورت رایگان در اختیار فروشندگان قرار می دهد.</span><br/><br/>
                        
                    </p>
                    <p id="step1S4" v-if="pageStep == 4">
                        <span>5-2 فروشنده تضمین می‌نماید که تمامی کالاهای تحویلی به خریدار مطابق قوانین جمهوری اسلامی ایران تولید شده و یا از مبادی رسمی کشور وارد گردیده است. همچنین کالاها سالم و مطابق با توصیفات اعلام شده از کلیه ابعاد کمی و کیفی می باشد و چنانچه در هر مرحله از عملیات فروش خلاف موارد فوق اثبات گردید، اینکوباک می تواند راساٌ نسبت به لغو سفارش اقدام نماید و چنانچه در این خصوص  خسارتی به اینکوباک یا خریدار وارد گردد فروشنده متعهد به جبران خسارت خواهد بود.</span><br/><br/>
                        <span>5-3  فروشنده اعلام می دارد که مالک کالا بوده و کالا معارض ندارد و حقوق مالکیت صنعتی و تجاری در صورت وجود، مالکیت معنوی و سایر حقوق قانونی و عرفی کالا متعلق به اوست یا حق بهره برداری از این حقوق و عرضه کالای مربوطه را دارد و مطابق قوانین جمهوری اسلامی ایران مجاز به فعالیت میباشد و چنانچه در هر مرحله از عملیات فروش خلاف موارد فوق اثبات گردید، اینکوباک می تواند راساٌ نسبت به لغو سفارش اقدام نماید و چنانچه در این خصوص  خسارتی به اینکوباک یا خریدار وارد گردد فروشنده متعهد به جبران خسارت خواهد بود.</span><br/><br/>
                        <span>5-4 فروشنده تعهد می‌نماید که در صورت اعمال هرگونه تغییر در اطلاعات کالا اعم از نوع، بهای کالا ،عدم موجودی کالا، توقف تولید یا عرضه محصول و همچنین تخفیف‌های ارائه شده به سایر خریداران ظرف مدت یک روزاطلاعات کالا را در سامانه اینکوباک به روز نماید در غیر این صورت مسئولیت کلیه خسارات وارده به اینکوباک و خریدار بر عهده فروشنده است.</span><br/><br/>
                        <span>5-5 فروشنده موظف است در زمان تعیین شده در قرارداد حاضر، کالای سفارش داده شده را تامین نماید و در زمان مشخص شده کالای سفارش داده شده را جهت تحویل به خریدار به متصدی حمل و نقل قانونی تحویل نماید . در صورت عدم تامین کالا و یا تامین ناقص در مدت زمان تعهد شده،  فروشنده بایستی به ازای هر روز تاخیر  2 درصد از مبلغ کل معامله را به عنوان جریمه تاخیر در تاًمین به اینکوباک پرداخت نماید. و چنانچه عدم تاًمین کالا و یا تامین ناقص بیش از 2 روز تقویمی به طول بیانجامد اینکوباک می تواند راساً نسبت به لغو معامله  اقدام نماید. که در این حالت فروشنده موظف به پرداخت 5 درصد از مبلغ کل معامله، به انضمام 4 درصد از مبلغ کل معامله پیش بینی شده در صدر بند(جمعاً 9 درصد از مبلغ کل معامله) به عنوان جریمه عدم تاًمین به اینکوباک پرداخت نماید و همچنین مسئول کلیه خسارات ناشی از عدم تاًمین و یا تامین ناقص کالا که برای اینکوباک یا خریدار ایجاد گردد می باشد.</span><br/><br/>
                    </p>
                    <p id="step1S5" v-if="pageStep == 5">
                        <span>5-6 فروشنده تضمین می نماید که کلیه اوصاف کمی و کیفی محصولات تامین شده کاملا مطابق با اظهارات درج شده توسط ایشان در سامانه اینکوباک میباشد که تمامی این اظهارات در قرارداد حاضر منعکس می گردد. با توجه به تعبیه نظام بازرسی توسط اینکوباک قبل از ارسال کالا و تحویل به متصدی حمل و نقل چنانچه عدم تطابق محموله با اطلاعات مندرج در سایت، مربوط به امور و اوصافی باشد که بایستی توسط بازرس اینکوباک بررسی گردد(شرح دقیق این اوصاف متناسب با  هرمعامله و به‌صورت احصایی در قرارداد مربوط به آن معامله قید میگردد) اینکوباک و فروشنده مشترکاً در قبال خریدار مسئول می‌باشند که میزان مسوولیت هر یک بر اساس حدود  قصور یا تقصیر آنها توسط مرجع داوری پیش بینی شده در  قرارداد حاضر تعیین می گردد. در غیر اینصورت مسئولیت عدم تطابق کالا بر عهده فروشنده می باشد و چنانچه این امر منجر به ورود هر گونه خسارتی به اینکوباک یا خریدار گردد فروشنده متعهد به جبران خسارت خواهد بود.</span><br/><br/>
                        <span>تبصره: در صورتی که فروشنده نسبت به آماده کردن محصول اقدام کرده باشد ولی نتواند در موعد مقرر نسب به تحویل آن اقدام کند  و  یا در صورتی که محصول آماده شده توسط فروشنده فاقد استانداردهای تعیین شده از سمت خریدار باشد،تصمیم درباره ی لغو یا ادامه معامله، و یا خرید تمام و یا بخشی از محصولات و شرایط مربوط به آن بر عهده اینکوباک و خریدار می باشد.</span><br/><br/>
                        <span>5-8 مسؤلیت تحویل کالای سفارش داده شده به متصدی حمل و نقل بر عهده ی فروشنده می باشد. فروشنده موظف است کالا را به شیوه بسته بندی صحیح . در شرایط استاندارد بارگیری به مقصد حمل و نقل قانونی تحویل داده و همچنین کالا را از طریق وسیله ی حمل ونقل دارای شرایط مناسب جهت حفظ سلامت کالا برای خریدار ارسال نماید مگر آنکه متصدی حمل و نقل توسط خریدار تعیین گردد که در این صورت فروشنده صرفا نسبت به انتخاب وسیله و متصدی حمل و نقل مسئولیتی ندارد. چنانچه از جهت عدم رعایت این بند خسارتی حاصل گردد فروشنده مسئول جبران کلیه ی خسارات ایجاد شده می باشد.</span><br/><br/>
                        <span> تبصره- چنانچه در طی حمل کالا خسارتی برای محموله ایجاد گردد موجب مسئولیت متصدی حمل و نقل طبق مقررات مربوطه در این زمینه می باشد.</span><br/><br/>
                        <span>تبصره - هزینه های مربوط به حمل و نقل و بیمه محموله ارسالی بر حسب مورد بر عهده خریدار و یا فروشنده می باشد.</span><br/><br/>
                        <span><b>ماده 6: تعهدات اینکوباک</b></span><br/><br/>
                        <span>بر اساس این قرارداد اینکوباک متعهد به انجام امور ذیل می باشد:</span><br/><br/>
                        <span>6-1  اینکوباک بخشی از سایت اینترنتی خود به نام incobac.com  را جهت  ارائه سفارشات  خریدار اختصاص می دهد و آموزش های لازم را به خریدار در این خصوص ارائه خواهد داد . </span><br/><br/>
                    </p>
                    <p id="step1S6" v-if="pageStep == 6">
                       
                        <span>6-2 اینکوباک خدمات بازرسی محصولات را از طریق ارائه کارشناس کیفیت محصول قبل از بارگیری کالا جهت انطباق کالای ارسالی با شرایط قید شده در قراداد  ارائه می‌نماید. لیست آیتم ها و اوصاف و شرایطی که بایستی توسط بازرس اینکوباک مورد بررسی قرار گیرد به صورت احصایی و متناسب با هر معامله در قرارداد مربوط به آن معامله قید می‌گردد. </span><br/><br/>
                       <span>6-3  با توجه به تعبیه نظام بازرسی توسط اینکوباک قبل از ارسال کالا و تحویل به متصدی حمل و نقل چنانچه عدم تطابق محموله با اطلاعات مندرج در سایت، مربوط به امور و اوصافی باشد که بایستی توسط بازرس اینکوباک بررسی گردد(شرح دقیق این اوصاف متناسب با  هرمعامله و به‌صورت احصایی در قرارداد مربوط به آن معامله قید میگردد) اینکوباک و فروشنده مشترکاً در قبال خریدار مسئول می‌باشند که میزان مسوولیت هر یک بر اساس حدود  قصور یا تقصیر آنها توسط مرجع داوری پیش بینی شده در  قرارداد حاضر تعیین می گردد. در غیر اینصورت مسئولیت عدم تطابق کالا بر عهده فروشنده می باشد و چنانچه این امر منجر به ورود هر گونه خسارتی به اینکوباک یا خریدار گردد فروشنده متعهد به جبران خسارت خواهد بود. </span><br/><br/>
                       <span>6-4 اینکوباک موظف به مدیریت و انتخاب فضا و ظاهر وب سایت می باشد</span><br/><br/>
                       <span>6-5 اینکوباک متعهد می گردد جهت ارسال سفارشات در سایت اینکوباک، پنل نرم افزاری seller cener را در اختیارخریدار قرار دهد و همچنین آموزش های مربوطه را به خریدار ارائه نماید .</span><br/><br/>
                       <span>6-6 اینکوباک در خصوص حمل و نقل کالا هیچ گونه وظیفه و تعهدی ندارد.
                        </span><br/><br/>
                       <span><b>ماده 7 :حق الزحمه</b></span><br/><br/>
                       <span>7-1حق الزحمه اینکوباک معادل ریالی و درصدی معین از مبلغ کل معامله طبق جدول تعرفه پیوست شماره یک قرارداد می باشد. حق الزحمه پیش از احتساب مالیات بر ارزش افزوده کالا محاسبه می گردد.</span><br/><br/>
                       <span>7-2مسئولیت دریافت وجه سفارشات از خریداران بر عهده اینکوباک می باشد.</span><br/><br/>
                    </p>
                    <p id="step1S7" v-if="pageStep == 7">
                        <span>7-3 اینکوباک طی هفت روز کاری بهای محصولات فروش رفته را (به غیر از سفارشات عودت داده شده یا سفارشات مورد شکایت و بررسی) که از خریدار دریافت کرده پس از کسر کمیسون  و سایر هزینه ها و مبالغ ذکر شده در قرارداد و پس از محاسبه به فروشنده پرداخت خواهد نمود.</span><br/><br/>
                       <span>تبصره: منظور از روز کاری هر روز هفته به استثنای جمعه و تعطیلات رسمی جمهوری اسلامی ایران از ساعت 8 الی 17 می باشد.</span><br/><br/>
                        <span><b>ماده 8 :مدت و تمدید قرارداد</b></span><br/><br/>
                        <span>8-1این قرارداد از تاریخ تایید الکترونیکی(درج شده در قرارداد) به مدت یک سال شمسی( ۳۶۵ روز تقویمی )اعتبار دارد و در موارد فورس ماژور به مدت آن اضافه میگردد.</span><br/><br/>
                        <span>8-2 پس از خاتمه قرارداد، تمدید قرارداد و ادامه همکاری طرفین و نحوه و شرایط آن نیاز به توافق مجدد طرفین قرارداد دارد.</span><br/><br/>
                        <span>8-3 تاریخ موثر شدن و شروع قرارداد از تاریخ تایید الکترونیکی قرارداد توسط خریدار می باشد.</span><br/><br/>
                        <span><b>ماده 9: فسخ قرارداد</b></span><br/><br/>
                        <span>9-1 چنانچه معامله میان خریدار و فروشنده به عللی از علل قانونی منجر به فسخ گردد، اینکوباک مستحق دریافت حق الزحمه مقرر برای آن معامله می باشد.</span><br/><br/>
                        <span><b>ماده 10:خسارات قراردادی</b></span><br/><br/>
                        <span>علاوه بر ضمانت اجرا های پیش بینی شده نسبت به برخی از تعهدات طرفین این قرارداد، چنانچه نسبت به سایر تعهدات موضوع این قرارداد هر یک از طرفین تخلفی از انجام تعهد خویش داشته باشد و در نتیجه این تخلف ضرری به منافع طرف مقابل، طرف متخلف و مقصر، متعهد به پرداخت خسارت به طرف مقابل می باشد که مطالبه خسارت و تعیین میزان آن در مرجع داوری این قرارداد به عمل می آید.</span><br/><br/>
                    </p>
                    <p id="step1S8" v-if="pageStep == 8">
                        <span><b>ماده11:مشترکات</b></span><br/><br/>
                        <span>11-1طرفین اعلام  میدارند کلیه  تاییدیه ها و قبول الکترونیکی به منزله تایید و قبول حضوری و شخصی می باشد و به استناد آن تعهدات انجام می پذیرد.</span><br/><br/>
                        <span>11-2طرفین اعلام می دارند این قرارداد هرگونه توافق یا ترتیبات شفاهی یا کتبی مغایر با قرارداد حاضر را که ممکن است در گذشته بین طرفین واقع شده باشد نسخ می نماید.</span><br/><br/>
                        <span>11-3 هیچ یک از مواد یا مفاد قرارداد حاضر به معنای شراکت یا وجود رابطه کارگر و کارفرمایی فی‌مابین خریدار و اینکوباک نبوده و نخواهد بود.</span><br/><br/>
                        <span>11-4 هیچ گونه تغییری در این توافقنامه معتبر نیست مگر با توافق کتبی یا الکترونیکی طرفین قرارداد.</span><br/><br/>
                        <span>11-5 طرفین اعلام می دارند مالکیت نرم افزار seller center متعلق به اینکوباک است.</span><br/><br/>
                        <span><b>ماده 12: حقوق مالکیت فکری</b></span><br/><br/>
                        <span>12-1 مالکیت سورس کدها و پلتفرم اینکوباک متعلق به اینکوباک می باشد و طرف دوم صرفاً اجازه بهره برداری از این پلتفرم را مطابق مفاد این قرارداد و سطح دسترسی اجازه داده شده توسط این قرارداد دارا می باشد. </span><br/><br/>
                        <span>12-2 مالکیت داده های تحصیل شده از طریق پلتفرم اینکوباک،تحلیل این داده ها، فروش نتایج تحلیل داده و استفاده پژوهشی و هرگونه استفاده دیگر از آنها با رعایت محرمانگی و عدم افشای اسرار صرفاً به اینکوباک تعلق داشته و طرف دوم هیچگونه حقی در این زمینه نخواهد داشت.</span><br/><br/>
                    </p>
                    <p id="step1S9" v-if="pageStep == 9">
                        <span><b>ماده 13: محرمانگی و عدم افشای اسرار</b></span><br/><br/>
                        <span>13-1 اطلاعات مربوط به این قرارداد  قرارداد، اسرار محرمانه تلقی می گردد لذا طرفین تضمین خواهند نمود که خود و اشخاص مرتبط با آنان اشخاص ذیربط آنها در تمام مدت این قرارداد و پس از اتمام آن اقدامات معمول جهت محرمانه نگاه داشتن تمام اطلاعات محرمانه ای که وی یا آنان ممکن است در ارتباط با هر کدام از طرف دیگر به دست آورند محرمانه تلقی خواهند کرد و جز در راستای مقاصد قراردادی از چنین اطلاعاتی استفاده نخواهند کرد و آنها را افشا نخواهند نمود.</span><br/><br/>
                        <span>13-2 طرفین باید تضمین نمایند که هر کدام از کارکنان، ماموران، مدیران عامل آنان یا اشخاص مرتبط با آنها که به موجب این قرارداد به اطلاعات محرمانه دسترسی دارند از طبیعت محرمانه این اطلاعات مطلع هستند و لازم است تا از شروط طرفین قرارداد پیروی نمایند بنابراین طرفی که اطلاعات را دریافت می نماید مسئول است که تضمین نماید تعهد رعایت محرمانگی و عدم استفاده مندرج در این ماده را به دقت رعایت می‌کند و در مقابل فعل یا ترک فعل کارکنان نمایندگان یا عوامل خود کاملا مسئول فرض می گردد.</span><br/><br/>
                        <span>13-3 هرگونه افشا و انتشار بدون مجوز این اطلاعات قابل تعقیب کیفری در مراجع قانونی و مطالبه خسارت در مرجع داوری این قرارداد است.  مبلغ خسارت مذکور طی داوری تعیین خواهد شد.</span><br/><br/>
                        <span>تبصره: اطلاعاتی که در اختیار عموم قرار دارند جزو اطلاعات محرمانه محسوب نمی گردد.</span><br/><br/>
                        <span><b>ماده 14:فورس ماژور</b></span><br/><br/>
                        <span>14-1 منظور از فورس ماژور در این قرارداد هرگونه حادثه و پیشامد غیرقابل پیش بینی، غیر قابل دفع و خارج از اراده و کنترل طرفین است. اعم از جنگ، بلایای طبیعی، آتش‌سوزی، اعتصاب ، تغییر قوانین و مقررات یا تعطیلی ادارات و نهادهای دولتی برای مدت بیش از یک هفته که به واسطه آن طرفی که در چنین شرایطی قرار گرفته است نمی تواند تمام یا بخشی از تعهدات خود، موضوع این قرارداد یاد قوانین مرتبط را ایفا نماید.</span><br/><br/>
                        <span>14-2 متعهد در صورتی از ایفای تعهدات در اثر فورس ماژور معاف می گردد که حداکثر تا  1 روز پس از اطلاع از چنین وضعیتی مراتب را ً به اطلاع طرف دیگر رسانیده باشد. 
                        </span><br/><br/>
                        
                    </p>
                    <p id="step1S10" v-if="pageStep == 10">
                        <span><b>ماده 15: ابلاغات</b></span><br/><br/>
                        <span>کلیه اختلافات و دعاوی ناشی از این قرارداد و یا راجع به آن از جمله انعقاد، اعتبار، فسخ ،تفسیر یا اجرای آن به مرکز داوری اتاق بازرگانی صنایع معادن و کشاورزی شیراز ارجاع می گردد. که مطابق با قانون اساسنامه و آیین داوری آن مرکز با رای یک یا سه نفر داور به صورت قطعی و لازم الاجرا حل و فصل می گردد. داور/ان علاوه بر مقررات حاکم عرف تجارتی ذیربط را نیز مراعات خواهند نمود. شرط داوری حاضر موافقتنامه مستقل از قرارداد اصلی تلقی می‌شود و در هر حال لازم الاجرا است.</span><br/><br/>
                        <span><b>ماده 16:حل وفصل اختلافات و داوری</b></span><br/><br/>
                        <span>کلیه اختلافات و دعاوی ناشی از این قرارداد و یا راجع به آن از جمله انعقاد، اعتبار، فسخ ،تفسیر یا اجرای آن به مرکز داوری اتاق بازرگانی صنایع معادن و کشاورزی شیراز ارجاع می گردد. که مطابق با قانون اساسنامه و آیین داوری آن مرکز با رای یک یا سه نفر داور به صورت قطعی و لازم الاجرا حل و فصل می گردد. داور/ان علاوه بر مقررات حاکم عرف تجارتی ذیربط را نیز مراعات خواهند نمود. شرط داوری حاضر موافقتنامه مستقل از قرارداد اصلی تلقی می‌شود و در هر حال لازم الاجرا است.</span><br/><br/>
                        <span><b>ماده 17: نسخ قرارداد</b></span><br/><br/>
                        <span>قرارداد حاضر در 17 ماده و پیوست های آن (اجزای لاینفک قرارداد) در یک نسخه الکترونیکی تهیه و تنظیم گردیده است و در راستای تایید مفاد آن به تایید الکترونیکی طرف دوم (که به منزله قبول و تایید و امضای حضوری وی می باشد) رسید.</span><br/><br/>
                        <span>
 بنا به مراتب فوق طرفین، قرارداد حاضر را از تاریخ درج شده در آن اجرایی نمودند. تمام/</span><br/><br/>
                    </p>
                    <p id="step1S11" v-if="pageStep == 11">
                        <span><b>الحاقیه</b></span><br/><br/>
                        <span><b>مهلت بارگیری محصول تا تاریخ <span class="text-danger">@{{transactionInfo.loading_end_date}}</span> خواهد بود.</b></span><br/><br/>
                        <span>@{{transactionInfo.admin_notes}}</span><br/><br/>
                    </p>
            </div>
            <div class="factor-detail contents col-xs-12">
                <div class="factor-title">
                    <div class="title-text col-xs-12 col-sm-4">
                        خلاصه گزارش مالی
                    </div>
                    <div class="serial-number col-xs-12 col-sm-4">
                        شماره سریال:  <span>@{{transactionInfo.id + 100000}}</span>
                    </div>
                    <div class="date-init col-xs-12 col-sm-4">
                        تاریخ انعقاد : <span>@{{transactionInfo.loading_end_date}}</span>
                    </div>
                </div>
                <div class="contents-detail col-xs-12">
                    <div class="col-xs-12 col-sm-6">
                        <table class="table table-striped">
                            <tr>
                                <td>مقدار خرید: </td>
                                <td>@{{transactionInfo.quantity}} کیلو گرم </td>
                            </tr>
                            <tr>
                                <td>مبلغ پیش پرداخت:</td>
                                <td> @{{transactionInfo.prepayment_amount}} تومان  </td>
                            </tr>
                            <tr>
                                <td>هزینه خدمات بازرسی: </td>
                                <td> @{{transactionInfo.inspection_price}} تومان </td>
                            </tr>

                        </table>
                    </div>
                    <div class="col-xs-12 col-sm-6">
                        <table class="table table-striped">
                            <tr>
                                <td> قیمت واحد: </td>
                                <td>@{{transactionInfo.unit_price}} تومان </td>
                            </tr>
                            <tr>
                                <td>  مبلغ پرداخت نهایی: </td>
                                <td> @{{transactionInfo.payment_amount}} تومان </td>
                            </tr>
                            <tr class="green-text">
                                <td>  جمع کل پرداختی: </td>
                                <td>  @{{transactionInfo.prepayment_amount + transactionInfo.payment_amount}} تومان </td>
                            </tr>

                        </table>
                    </div>
                </div>
            </div>

        </div>
        <!--end part 1-->
    </section>
</main>
@endsection


@section('body_script_tags')
    <script>
        var transactionId = {{$transaction_id}} ;
    </script>
    <script src="{{asset('assets/js/dashboard/buyer/transaction-report-detail.js')}}"></script>
    <script src="{{asset('assets/js/dashboard/buyer/api-transaction-report-detail.js')}}"></script>
@endsection