<style scoped >


    .col-xs-1,
    .col-xs-2,
    .col-xs-3,
    .col-xs-4,
    .col-xs-5,
    .col-xs-6,
    .col-xs-7,
    .col-xs-8,
    .col-xs-9,
    .col-xs-10,
    .col-xs-11,
    .col-xs-12,
    .col-sm-1,
    .col-sm-2,
    .col-sm-3,
    .col-sm-4,
    .col-sm-5,
    .col-sm-6,
    .col-sm-7,
    .col-sm-8,
    .col-sm-9,
    .col-sm-10,
    .col-sm-11,
    .col-sm-12,
    .col-md-1,
    .col-md-2,
    .col-md-3,
    .col-md-4,
    .col-md-5,
    .col-md-6,
    .col-md-7,
    .col-md-8,
    .col-md-9,
    .col-md-10,
    .col-md-11,
    .col-md-12,
    .col-lg-1,
    .col-lg-2,
    .col-lg-3,
    .col-lg-4,
    .col-lg-5,
    .col-lg-6,
    .col-lg-7,
    .col-lg-8,
    .col-lg-9,
    .col-lg-10,
    .col-lg-11,
    .col-lg-12{
        float: right;
    }

    /*start main content style */
    .image-content-post {
        width: 30%;
        float: right;
        position: relative;
    }

    .image-content-post img {
        border-radius: 3px;
        transition: 200ms;
        filter: grayscale(30%);
    }

    .image-content-post a:hover img {
        filter: grayscale(0);
        transition: 200ms;
    }

    .image-content-post i {
        display: none;
        position: absolute;
        top: 46%;
        left: 0;
        right: 0;
        text-align: center;
        font-size: 35px;
        color: #fff;
        z-index: 1;

    }

    .image-content-post a:hover i {
        display: block;
    }

    .content-item {
        overflow: hidden;
        text-align: right;
        direction: rtl;
    }

    .main-content {
        padding: 60px 15px;
    }

    .header-label {
        display: block;
        margin: 13px;
        padding: 0;
    }

    /*end main content style */
    /*custom cods*/
    .green-button {
        margin: 15px 0;
        display: inline-block;
        background: #00c569;
        color: #fff;
        padding: 10px 35px;
        border-radius: 3px;
        text-align: center;
        border: none;
        transition: 300ms;
    }
    .green-button:focus,.gray-bot:focus {
        color: #fff;
    }
    .default_btn{
        margin: 15px 0;
        display: inline-block;
        background: #eee;
        color: #444;
        padding: 10px 35px;
        border-radius: 3px;
        text-align: center;
        border: none;
        transition: 300ms;
    }
    .gray-bot {
        margin: 15px 0;
        display: inline-block;
        background: #85888d;
        color: #fff;
        padding: 10px 35px;
        border-radius: 3px;
        text-align: center;
        border: none;
        transition: 300ms;
    }
    .default_btn:hover {
        color: #444;
        background: #ddd;
        transition: 300ms;
        cursor: pointer;
    }
    .green-button:hover {
        color: #fff;
        background: #00ac5c;
        transition: 300ms;

    }
    .gray-bot:hover {
        color: #fff;
        background: #72757a;
        transition: 300ms;

    }

    .botton-inco {
        margin: 15px 7px;
        display: inline-block;
        color: #313a43;
        padding: 8px 35px;
        border-radius: 3px;
        text-align: center;
    }

    .botton-inco:hover {
        color: #fff;
    }

    .font-big {
        font-size: 23px;
        position: relative;
        top: 3px;
    }

    .little_header {
        width: 80px;
    }

    .little-main-header {
        right: 80px;
    }

    .background_mob_sec {
        position: fixed;
        right: 0;
        left: 0;
        bottom: 0;
        top: 0;
        background: rgba(0, 0, 0, 0.6);
        z-index: -1;
        display: none;
    }

    .kind_user, .kind_activity {
        margin: 7px 0;
        border-bottom: 1px solid #eff3f6;
        padding-bottom: 10px;
    }

    .kind_user > div, .kind_activity > div {
        float: right;
        overflow: hidden;
        padding: 10px;
        font-size: 15px;
    }

    .kind_user input, .kind_activity input {
        cursor: pointer;
        width: 23px;
        height: 23px;
        float: right;
        position: absolute;
        top: 2px;
        right: 65px;
        opacity: 0;
    }

    .kind_user input:checked + i, .kind_activity input:checked + i {
        color: #00c569;
        border: none;
        padding: 4px;
    }

    .kind_user i, .kind_activity i {
        background: none;
        width: 23px;
        height: 23px;
        display: block;
        position: absolute;
        top: 4px;
        right: 65px;
        z-index: -1;
        color: #808c9c;
        border-radius: 50%;
        padding: 2px;
        font-size: 14px;
        border: 2px solid;
    }

    .user-form {
        padding: 0;
    }
    .alert-message{
        padding: 20px;

        text-align: right;
    }
    .user-form input[type="text"] {
        width: 100%;
        border: 1px solid #e9e9e9;
        padding: 15px 20px;
        margin: 7px auto;
        border-radius: 4px;
        transition: 300ms;
    }

    .user-form input[type="button"] {
        width: 100%;

    }

    .user-form input[type="text"]:focus {
        border: 1px solid #00c569;
        transition: 500ms;
    }

    .img-profile {
        float: right;
    }

    #icon-pro {
        width: 150px;
        height: 150px;
        display: inline-block;
    }

    #icon-pro svg {
        height: 150px;
    }

    .main-content-nav {
        margin: 20px auto;

        width: 80%;

        float: none;
    }
    .main-content-nav ul {
        text-align: center;
        margin-right: -25px;
    }

    .main-content-nav li {
        padding: 14px 50px;
        position: relative;
        background: #fbfbfb;
        font-size: 18px;
    }
    .main-content-nav li a{
        color: #999;
    }
    .main-content-nav li.active a{
        color: #333;
    }
    .main-content-nav li:after {
        content: "";
        position: absolute;
        right: 0;
        bottom: 0;
        width: 0;
        height: 0;
        border-right: 20px solid #fff;
        border-top: 26px solid transparent;
        border-bottom: 20px solid transparent;
    }

    .main-content-nav li:before {
        content: "";
        position: absolute;
        left: -20px;
        bottom: 0;
        width: 0;
        height: 0;
        border-right: 20px solid #fbfbfb;
        border-top: 26px solid transparent;
        border-bottom: 20px solid transparent;
        z-index: 1;
    }
    .main-content-nav li.active {
        background: #f7f7f7;
        color: #333;
    }
    .main-content-nav li.active:before {
        border-right-color: #f7f7f7;
    }
    #main .contents{
        text-align: center;

        background: #f7f7f7;

        width: 80%;

        margin: 0 auto;

        float: none;

        overflow: hidden;

        border-radius: 3px;

        line-height: 1.618;

        direction: rtl;
    }
    #main .contents p{
        text-align: right;
    }
    #main .contents h2{
        margin: 20px auto;
    }

    #main .continue_but{
        float: right;
    }

    #main .main_buttons{
        float: right;

    }

    #step1 .main_buttons{
        text-align: right;
    }
    /*part 2*/
    .main-content-texts{
        background: #fff;

        border-radius: 3px;
    }
    .header-contents{
        background: #fff;
        margin: 15px auto;
        border-radius: 3px;
        padding: 10px;
        text-align: left;
    }

    .header-contents .title-contents{
        text-align: right;
    }

    .contents h2{
        font-size: 22px;
    }
    .description-text{
        font-size: 12px;
        padding: 5px 0;
        border-top:1px solid #ddd;

    }
    .services td {
        color: #00d613;
    }

    .pre-pay td {
        color: #e41c38;
    }

    @media screen and (max-width: 991px) {
        .right-header.desktop-header {
            display: none;
        }

        .right-header.mobile-header {
            display: block;
            right: -300px;
        }

        .main-header, .little-main-header {
            right: 0 !important;
        }

        #main, #main.little-main {
            margin-right: 0 !important;
        }

        .post-contents-table {
            width: 100%;
        }

        .copy-right {
            display: none;
        }

        .close_menu {
            display: none;
        }

        .close_menu_mob {
            display: block;
        }

        .show-header button {
            display: block;
        }

        .kind_user > div, .kind_activity > div {
            float: none;

        }

        .img-profile .submit {
            position: relative;
            width: 100%;
            margin: 25px auto;

        }

        .img-profile .submit label {
            width: 40%;
            padding: 12px 0;
        }

        .img-profile {
            float: none;
        }
    }

    @media screen and (max-width: 768px) {
        .image-content-post, .contents-post {
            width: 100%;
            float: none;
            margin: 10px 0;
            padding: 0;
        }

        .name-header-profile {
            display: none;
        }

        .profile-menu-header {
            padding: 7px;
            padding-left: 36px;
        }
    }

    @media screen and (max-width: 555px) {
        .content-header {
            display: none;
        }

    }

    @media screen and (max-width: 345px) {
        .sub-header a {
            font-size: 10px;

        }

        .sub-header {

            bottom: -44px;

        }
    }
</style>

<template>
    <section  class="main-content col-xs-12">
        <!--part 1-->
        <div id="step1">
            <div class="contents col-xs-12">
                <div class="content-show">
                    <div class="buttons">
                        <div class="main_buttons col-xs-12 col-sm-8 col-md-9">
                            <a href="#" class="default_btn" @click.prevent="goToNextPage()">صفحه بعد</a>
                            <a href="#" class="default_btn" @click.prevent="goToPrePage()">صفحه قبل</a>
                        </div>
                        <div class="continue_but col-xs-12 col-sm-4 col-md-3">
                            <a href="#" @click.prevent="confirmContract" class="green-button">تایید قرارداد</a>
                        </div>
                    </div>
                    <h2>قراداد همکاری در خرید</h2>
                    <p id="step1S1" v-if="pageStep === 1">
                        <span><b> ماده 1 :طرفین قرارداد</b></span><br/><br/>

                        <span>1-1 طرف اول: شرکت سهامی خاص فناوران توسعه تجارت ارم  به شماره ثبت 49223  به آدرس شیراز-میدان ارم- ساختمان مدیریت دانشگاه شیراز-طبقه نهم و کدپستی 7194684334 و شماره تماس 02171053525 که از این پس باسکول نامیده می شود.</span><br/>
                        <span>1-2 طرف دوم: هر شخص حقیقی یا حقوقی به نام {{currentUser.user_info.first_name + ' ' + currentUser.user_info.last_name}} به شماره ثبت /جواز کسب {{currentUser.profile.company_register_code}} و   به آدرس {{currentUser.profile.address}} و کدپستی {{currentUser.profile.postal_code}} و شماره تماس {{currentUser.profile.public_phone}} که از این به بعد خریدار نامیده می شود.</span>
                        <br/><br/>

                        <span><b> ماده 2 :موضوع قرارداد</b></span><br/><br/>
                        <span>2-1  تنظیم همکاری و روابط قراردادی طرفین در خصوص همکاری باسکول با خریدار جهت خرید کالا و محصولات فروشنده از طریق وبسایت ایجاد شده توسط باسکول به نشانی buskool.com .بدیهی است با توجه به اینکه مالکیت محصولات ارائه شده در سایت متعلق به باسکول نبوده و باسکول صرفاً ارائه دهنده بستر اینترنتی جهت فروش محصولات فوق می باشد لذا مسئولیت کلیه اوصاف محصول اعم از نوع، بسته بندی، قیمت و هرگونه اطلاعات ذکر شده در رابطه با محصول بر عهده فروشنده است.
                       </span><br/><br/>
                        <span>2-2 باسکول بر اساس اطلاعات ذکر شده در سایت اقدام به صدور فاکتور برای طرفین می نماید که این فاکتور در اختیار طرفین قرار می گیرد و مبنای رسیدگی به کلیه اختلافات حاصله،  قرارداد حاضر و فاکتور مذکور می باشد.</span><br/><br/>
                        <span>2-3 با توجه به شرایط خاص هر معامله، هزینه های مربوط به حمل و نقل و بیمه کالاهای مورد معامله ممکن است بر عهده خریدار یا فروشنده قرار گیرد که این امر در قرارداد حاضر قید و مورد تایید طرف متعهد قرار می گیرد در هر صورت باسکول نسبت به هزینه های فوق الذکر از خود سلب مسئولیت می‌نماید.</span><br/><br/>

                        <span><b>ماده 3 :مکانیسم اجرایی عملیات خرید و فروش</b></span><br/><br/>
                        <span>3-1خریدار و فروشنده با پذیرش قرارداد حاضر می توانند از بستر اینترنتی ارائه شده توسط طرف اول (پلتفرم باسکول) جهت سفارش و ارائه محصولات استفاده نمایند.</span><br/>

                    </p>
                    <p id="step1S2" v-if="pageStep === 2">
                        <span>3-2خریدار درخواست خود را از طریق سفارش کالا به صورت الکترونیکی برای باسکول ارسال و باسکول تقاضای خرید خریدار را از طریق ایمیل یا seller center به فروشندگان مرتبط اعلام می نماید.</span><br/><br/>
                        <span>3-3 چنانچه فروشنده قادر به تامین سفارش خریدار باشد پاسخ خود را با ذکر اوصاف و پیوست تصاویر محصولات ، برای خریدار ارسال می نماید.</span><br/><br/>
                        <span>3-4 چنانچه خریدار پیشنهاد فروشنده را در پنل کاربری خویش پذیرفت، اپراتور های باسکول اقدام به برقراری تماس تلفنی و انجام هماهنگی های نهایی  با طرفین نموده و در صورت حصول توافق، متن قرارداد را برای طرفین ارسال می نمایند که ملاک زمانی انعقاد قراداد، زمان تایید الکترونیکی متن قرارداد ارسالی برای طرفین( خریدار و فروشنده) می باشد.</span><br/><br/>
                        <span>3-5: پس از تایید قرارداد توسط طرفین فاکتور پیش پرداخت توسط باسکول صادر گردیده و خریدار بایستی ظرف مدت .یک روز نسبت به پرداخت آن اقدام نماید.</span><br/><br/>
                        <span>3-6  در صورت تادیه پیش پرداخت توسط خریدار، فروشنده بایستی ظرف مهلتی که در قرارداد حاضر قید می گردد کالای سفارش داده شده را تهیه و جهت ارسال به متصدی حمل و نقل تسلیم نماید. بدیهی است که کلیه مسؤلیت های ناشی از تامین سفارش و همچنین تحویل کالا به متصدی حمل و نقل قانونی بر عهده فروشنده می باشد. </span><br/><br/>
                        <span>3-7 قبل از تسلیم کالا به متصدی حمل و نقل و انجام عملیات بارگیری، بازرس باسکول در محل بارگیری حضور می یابد و کالای سفارش داده شده را از جهت انطباق با مفاد قرارداد حاضر مورد بررسی قرار می دهد.(تعیین موارد و اوصافی که در هر سفارش بایستی توسط بازرس باسکول مورد بررسی و تایید قرار گیرد به پیوست قرارداد حاضر در اختیار خریدار و فروشنده قرار خواهد گرفت). بدیهی است که بازرس باسکول صرفاً نسبت به بررسی این اوصاف مسئولیت داشته و سایر اوصاف و موارد از حیطه مسئولیت بازرس باسکول خارج می باشد.</span><br/><br/>
                        <span>3-8 در صورت تأیید محصولات توسط بازرس، این امر تلفناً به اطلاع خریدار رسیده و فاکتور نهایی قراداد توسط باسکول صادر می گردد و خریدار بایستی ظرف مدت 2 ساعت از اتمام بارگیری نسبت به تسویه مبلغ باقی مانده قراداد اقدام نماید که در این صورت محصولات تحویل متصدی حمل و نقل می‌گردد و پس از گذشت یک هفته از پایان تراکنش، باسکول پس از کسر کمیسیون خود از معامله ، ثمن معامله را به حساب فروشنده واریز خواهد کرد.</span><br/><br/>
                    </p>
                    <p id="step1S3" v-if="pageStep === 3">
                        <span>3-9 بدیهی است با توجه به عدم مالکیت باسکول بر محصولات ارائه شده در بستر اینترنتی، فروش کالا به خریدار نهایی توسط فروشنده انجام می پذیرد و باسکول صرفا زیرساخت انجام فروش را فراهم می نماید لذا در صورت صدور فاکتور در وجه باسکول و اظهار نمودن آن در گزارشات مالیاتی مراتب مورد تایید این شرکت نبوده و همچنین این شرکت هیچگونه مسئولیتی بر عهده نخواهد داشت و مسئولیت خسارت وارده احتمالی بر عهده متخلف از این بند خواهد بود. </span><br/><br/>
                        <span><b>ماده 4: تعهدات خریدار</b></span><br/><br/>
                        <span>خریدار متعهد می باشد پس از تامین بار توسط فروشنده جهت بارگیری  و تایید نهایی بازرس باسکول ، نسبت به تسویه حساب و پرداخت مبلغ فاکتور نهایی  قراداد، حداکثر ظرف مدت 2 ساعت اقدام نماید.  و چنانچه نسبت  به تسویه حساب در زمان مقرر اقدام ننماید ، مبلغ پانصد هزار تومان به انضمام 5 درصد از مبلغ کل معامله  از پیش پرداخت واریزی توسط خریدار به عنوان جریمه  لغو معامله کسر و مابقی مبلغ پیش پرداخت به وی مسترد می گردد. همچنین چنانچه در این خصوص خسارتی به باسکول یا فروشنده وارد گردد خریدار متعهد به جبران خسارت خواهد بود که مبلغ خسارت ایجاد شده به انضمام مبالغ جریمه فوق، از پیش پرداخت واریزی توسط خریدار کسر و مابقی به وی مسترد می گردد و تا تعیین تکلیف نهایی در خصوص خسارت مورد ادعا و اجرای رای قطعی مرکز داوری پیش بینی شده در قرارداد، پیش پرداخت واریزی توسط خریدار به عنوان ضمانت اجرای رای داور در حساب بانکی باسکول ذکر شده در قرارداد نگهداری می گردد.</span><br/><br/>

                        <span><b>ماده 5: تعهدات و تضمینات فروشنده</b></span><br/><br/>
                        <span>بر اساس شرایط این قرارداد فروشنده موظف به انجام امور ذیل می باشد.</span><br/><br/>
                        <span>5-1 مسئولیت تعیین و درج قیمت کالا ، تولید و درج اطلاعات محصول اعم از کلیه اطلاعات کمی و کیفی محصول و به‌روزرسانی میزان موجودی محصول در وبسایت باسکول بر عهده فروشنده می باشد. قیمت‌های مندرج بر روی , وبسایت باسکول می‌بایست رقابتی و حداقل برابر با قیمت کالاهای همانند در سایر فروشگاه ها اعم از اینترنتی و غیر اینترنتی باشد</span><br/><br/>
                        <span>تبصره: باسکول زیرساخت و ابزار ساخت محتوا را به صورت رایگان در اختیار فروشندگان قرار می دهد.</span><br/><br/>

                    </p>
                    <p id="step1S4" v-if="pageStep === 4">
                        <span>5-2 فروشنده تضمین می‌نماید که تمامی کالاهای تحویلی به خریدار مطابق قوانین جمهوری اسلامی ایران تولید شده و یا از مبادی رسمی کشور وارد گردیده است. همچنین کالاها سالم و مطابق با توصیفات اعلام شده از کلیه ابعاد کمی و کیفی می باشد و چنانچه در هر مرحله از عملیات فروش خلاف موارد فوق اثبات گردید، باسکول می تواند راساٌ نسبت به لغو سفارش اقدام نماید و چنانچه در این خصوص  خسارتی به باسکول یا خریدار وارد گردد فروشنده متعهد به جبران خسارت خواهد بود.</span><br/><br/>
                        <span>5-3  فروشنده اعلام می دارد که مالک کالا بوده و کالا معارض ندارد و حقوق مالکیت صنعتی و تجاری در صورت وجود، مالکیت معنوی و سایر حقوق قانونی و عرفی کالا متعلق به اوست یا حق بهره برداری از این حقوق و عرضه کالای مربوطه را دارد و مطابق قوانین جمهوری اسلامی ایران مجاز به فعالیت میباشد و چنانچه در هر مرحله از عملیات فروش خلاف موارد فوق اثبات گردید، باسکول می تواند راساٌ نسبت به لغو سفارش اقدام نماید و چنانچه در این خصوص  خسارتی به باسکول یا خریدار وارد گردد فروشنده متعهد به جبران خسارت خواهد بود.</span><br/><br/>
                        <span>5-4 فروشنده تعهد می‌نماید که در صورت اعمال هرگونه تغییر در اطلاعات کالا اعم از نوع، بهای کالا ،عدم موجودی کالا، توقف تولید یا عرضه محصول و همچنین تخفیف‌های ارائه شده به سایر خریداران ظرف مدت یک روزاطلاعات کالا را در سامانه باسکول به روز نماید در غیر این صورت مسئولیت کلیه خسارات وارده به باسکول و خریدار بر عهده فروشنده است.</span><br/><br/>
                        <span>5-5 فروشنده موظف است در زمان تعیین شده در قرارداد حاضر، کالای سفارش داده شده را تامین نماید و در زمان مشخص شده کالای سفارش داده شده را جهت تحویل به خریدار به متصدی حمل و نقل قانونی تحویل نماید . در صورت عدم تامین کالا و یا تامین ناقص در مدت زمان تعهد شده،  فروشنده بایستی به ازای هر روز تاخیر  2 درصد از مبلغ کل معامله را به عنوان جریمه تاخیر در تاًمین به باسکول پرداخت نماید. و چنانچه عدم تاًمین کالا و یا تامین ناقص بیش از 2 روز تقویمی به طول بیانجامد باسکول می تواند راساً نسبت به لغو معامله  اقدام نماید. که در این حالت فروشنده موظف به پرداخت 5 درصد از مبلغ کل معامله، به انضمام 4 درصد از مبلغ کل معامله پیش بینی شده در صدر بند(جمعاً 9 درصد از مبلغ کل معامله) به عنوان جریمه عدم تاًمین به باسکول پرداخت نماید و همچنین مسئول کلیه خسارات ناشی از عدم تاًمین و یا تامین ناقص کالا که برای باسکول یا خریدار ایجاد گردد می باشد.</span><br/><br/>
                    </p>
                    <p id="step1S5" v-if="pageStep === 5">
                        <span>5-6 فروشنده تضمین می نماید که کلیه اوصاف کمی و کیفی محصولات تامین شده کاملا مطابق با اظهارات درج شده توسط ایشان در سامانه باسکول میباشد که تمامی این اظهارات در قرارداد حاضر منعکس می گردد. با توجه به تعبیه نظام بازرسی توسط باسکول قبل از ارسال کالا و تحویل به متصدی حمل و نقل چنانچه عدم تطابق محموله با اطلاعات مندرج در سایت، مربوط به امور و اوصافی باشد که بایستی توسط بازرس باسکول بررسی گردد(شرح دقیق این اوصاف متناسب با  هرمعامله و به‌صورت احصایی در قرارداد مربوط به آن معامله قید میگردد) باسکول و فروشنده مشترکاً در قبال خریدار مسئول می‌باشند که میزان مسوولیت هر یک بر اساس حدود  قصور یا تقصیر آنها توسط مرجع داوری پیش بینی شده در  قرارداد حاضر تعیین می گردد. در غیر اینصورت مسئولیت عدم تطابق کالا بر عهده فروشنده می باشد و چنانچه این امر منجر به ورود هر گونه خسارتی به باسکول یا خریدار گردد فروشنده متعهد به جبران خسارت خواهد بود.</span><br/><br/>
                        <span>تبصره: در صورتی که فروشنده نسبت به آماده کردن محصول اقدام کرده باشد ولی نتواند در موعد مقرر نسب به تحویل آن اقدام کند  و  یا در صورتی که محصول آماده شده توسط فروشنده فاقد استانداردهای تعیین شده از سمت خریدار باشد،تصمیم درباره ی لغو یا ادامه معامله، و یا خرید تمام و یا بخشی از محصولات و شرایط مربوط به آن بر عهده باسکول و خریدار می باشد.</span><br/><br/>
                        <span>5-8 مسؤلیت تحویل کالای سفارش داده شده به متصدی حمل و نقل بر عهده ی فروشنده می باشد. فروشنده موظف است کالا را به شیوه بسته بندی صحیح . در شرایط استاندارد بارگیری به مقصد حمل و نقل قانونی تحویل داده و همچنین کالا را از طریق وسیله ی حمل ونقل دارای شرایط مناسب جهت حفظ سلامت کالا برای خریدار ارسال نماید مگر آنکه متصدی حمل و نقل توسط خریدار تعیین گردد که در این صورت فروشنده صرفا نسبت به انتخاب وسیله و متصدی حمل و نقل مسئولیتی ندارد. چنانچه از جهت عدم رعایت این بند خسارتی حاصل گردد فروشنده مسئول جبران کلیه ی خسارات ایجاد شده می باشد.</span><br/><br/>
                        <span> تبصره- چنانچه در طی حمل کالا خسارتی برای محموله ایجاد گردد موجب مسئولیت متصدی حمل و نقل طبق مقررات مربوطه در این زمینه می باشد.</span><br/><br/>
                        <span>تبصره - هزینه های مربوط به حمل و نقل و بیمه محموله ارسالی بر حسب مورد بر عهده خریدار و یا فروشنده می باشد.</span><br/><br/>
                        <span><b>ماده 6: تعهدات باسکول</b></span><br/><br/>
                        <span>بر اساس این قرارداد باسکول متعهد به انجام امور ذیل می باشد:</span><br/><br/>
                        <span>6-1  باسکول بخشی از سایت اینترنتی خود به نام buskool.com  را جهت  ارائه سفارشات  خریدار اختصاص می دهد و آموزش های لازم را به خریدار در این خصوص ارائه خواهد داد . </span><br/><br/>
                    </p>
                    <p id="step1S6" v-if="pageStep === 6">

                        <span>6-2 باسکول خدمات بازرسی محصولات را از طریق ارائه کارشناس کیفیت محصول قبل از بارگیری کالا جهت انطباق کالای ارسالی با شرایط قید شده در قراداد  ارائه می‌نماید. لیست آیتم ها و اوصاف و شرایطی که بایستی توسط بازرس باسکول مورد بررسی قرار گیرد به صورت احصایی و متناسب با هر معامله در قرارداد مربوط به آن معامله قید می‌گردد. </span><br/><br/>
                        <span>6-3  با توجه به تعبیه نظام بازرسی توسط باسکول قبل از ارسال کالا و تحویل به متصدی حمل و نقل چنانچه عدم تطابق محموله با اطلاعات مندرج در سایت، مربوط به امور و اوصافی باشد که بایستی توسط بازرس باسکول بررسی گردد(شرح دقیق این اوصاف متناسب با  هرمعامله و به‌صورت احصایی در قرارداد مربوط به آن معامله قید میگردد) باسکول و فروشنده مشترکاً در قبال خریدار مسئول می‌باشند که میزان مسوولیت هر یک بر اساس حدود  قصور یا تقصیر آنها توسط مرجع داوری پیش بینی شده در  قرارداد حاضر تعیین می گردد. در غیر اینصورت مسئولیت عدم تطابق کالا بر عهده فروشنده می باشد و چنانچه این امر منجر به ورود هر گونه خسارتی به باسکول یا خریدار گردد فروشنده متعهد به جبران خسارت خواهد بود. </span><br/><br/>
                        <span>6-4 باسکول موظف به مدیریت و انتخاب فضا و ظاهر وب سایت می باشد</span><br/><br/>
                        <span>6-5 باسکول متعهد می گردد جهت ارسال سفارشات در سایت باسکول، پنل نرم افزاری seller cener را در اختیارخریدار قرار دهد و همچنین آموزش های مربوطه را به خریدار ارائه نماید .</span><br/><br/>
                        <span>6-6 باسکول در خصوص حمل و نقل کالا هیچ گونه وظیفه و تعهدی ندارد.
                        </span><br/><br/>
                        <span><b>ماده 7 :حق الزحمه</b></span><br/><br/>
                        <span>7-1حق الزحمه باسکول معادل ریالی و درصدی معین از مبلغ کل معامله طبق جدول تعرفه پیوست شماره یک قرارداد می باشد. حق الزحمه پیش از احتساب مالیات بر ارزش افزوده کالا محاسبه می گردد.</span><br/><br/>
                        <span>7-2مسئولیت دریافت وجه سفارشات از خریداران بر عهده باسکول می باشد.</span><br/><br/>
                    </p>
                    <p id="step1S7" v-if="pageStep === 7">
                        <span>7-3 باسکول طی هفت روز کاری بهای محصولات فروش رفته را (به غیر از سفارشات عودت داده شده یا سفارشات مورد شکایت و بررسی) که از خریدار دریافت کرده پس از کسر کمیسون  و سایر هزینه ها و مبالغ ذکر شده در قرارداد و پس از محاسبه به فروشنده پرداخت خواهد نمود.</span><br/><br/>
                        <span>تبصره: منظور از روز کاری هر روز هفته به استثنای جمعه و تعطیلات رسمی جمهوری اسلامی ایران از ساعت 8 الی 17 می باشد.</span><br/><br/>
                        <span><b>ماده 8 :مدت و تمدید قرارداد</b></span><br/><br/>
                        <span>8-1این قرارداد از تاریخ تایید الکترونیکی(درج شده در قرارداد) به مدت یک سال شمسی( ۳۶۵ روز تقویمی )اعتبار دارد و در موارد فورس ماژور به مدت آن اضافه میگردد.</span><br/><br/>
                        <span>8-2 پس از خاتمه قرارداد، تمدید قرارداد و ادامه همکاری طرفین و نحوه و شرایط آن نیاز به توافق مجدد طرفین قرارداد دارد.</span><br/><br/>
                        <span>8-3 تاریخ موثر شدن و شروع قرارداد از تاریخ تایید الکترونیکی قرارداد توسط خریدار می باشد.</span><br/><br/>
                        <span><b>ماده 9: فسخ قرارداد</b></span><br/><br/>
                        <span>9-1 چنانچه معامله میان خریدار و فروشنده به عللی از علل قانونی منجر به فسخ گردد، باسکول مستحق دریافت حق الزحمه مقرر برای آن معامله می باشد.</span><br/><br/>
                        <span><b>ماده 10:خسارات قراردادی</b></span><br/><br/>
                        <span>علاوه بر ضمانت اجرا های پیش بینی شده نسبت به برخی از تعهدات طرفین این قرارداد، چنانچه نسبت به سایر تعهدات موضوع این قرارداد هر یک از طرفین تخلفی از انجام تعهد خویش داشته باشد و در نتیجه این تخلف ضرری به منافع طرف مقابل، طرف متخلف و مقصر، متعهد به پرداخت خسارت به طرف مقابل می باشد که مطالبه خسارت و تعیین میزان آن در مرجع داوری این قرارداد به عمل می آید.</span><br/><br/>
                    </p>
                    <p id="step1S8" v-if="pageStep === 8">
                        <span><b>ماده11:مشترکات</b></span><br/><br/>
                        <span>11-1طرفین اعلام  میدارند کلیه  تاییدیه ها و قبول الکترونیکی به منزله تایید و قبول حضوری و شخصی می باشد و به استناد آن تعهدات انجام می پذیرد.</span><br/><br/>
                        <span>11-2طرفین اعلام می دارند این قرارداد هرگونه توافق یا ترتیبات شفاهی یا کتبی مغایر با قرارداد حاضر را که ممکن است در گذشته بین طرفین واقع شده باشد نسخ می نماید.</span><br/><br/>
                        <span>11-3 هیچ یک از مواد یا مفاد قرارداد حاضر به معنای شراکت یا وجود رابطه کارگر و کارفرمایی فی‌مابین خریدار و باسکول نبوده و نخواهد بود.</span><br/><br/>
                        <span>11-4 هیچ گونه تغییری در این توافقنامه معتبر نیست مگر با توافق کتبی یا الکترونیکی طرفین قرارداد.</span><br/><br/>
                        <span>11-5 طرفین اعلام می دارند مالکیت نرم افزار seller center متعلق به باسکول است.</span><br/><br/>
                        <span><b>ماده 12: حقوق مالکیت فکری</b></span><br/><br/>
                        <span>12-1 مالکیت سورس کدها و پلتفرم باسکول متعلق به باسکول می باشد و طرف دوم صرفاً اجازه بهره برداری از این پلتفرم را مطابق مفاد این قرارداد و سطح دسترسی اجازه داده شده توسط این قرارداد دارا می باشد. </span><br/><br/>
                        <span>12-2 مالکیت داده های تحصیل شده از طریق پلتفرم باسکول،تحلیل این داده ها، فروش نتایج تحلیل داده و استفاده پژوهشی و هرگونه استفاده دیگر از آنها با رعایت محرمانگی و عدم افشای اسرار صرفاً به باسکول تعلق داشته و طرف دوم هیچگونه حقی در این زمینه نخواهد داشت.</span><br/><br/>
                    </p>
                    <p id="step1S9" v-if="pageStep === 9">
                        <span><b>ماده 13: محرمانگی و عدم افشای اسرار</b></span><br/><br/>
                        <span>13-1 اطلاعات مربوط به این قرارداد  قرارداد، اسرار محرمانه تلقی می گردد لذا طرفین تضمین خواهند نمود که خود و اشخاص مرتبط با آنان اشخاص ذیربط آنها در تمام مدت این قرارداد و پس از اتمام آن اقدامات معمول جهت محرمانه نگاه داشتن تمام اطلاعات محرمانه ای که وی یا آنان ممکن است در ارتباط با هر کدام از طرف دیگر به دست آورند محرمانه تلقی خواهند کرد و جز در راستای مقاصد قراردادی از چنین اطلاعاتی استفاده نخواهند کرد و آنها را افشا نخواهند نمود.</span><br/><br/>
                        <span>13-2 طرفین باید تضمین نمایند که هر کدام از کارکنان، ماموران، مدیران عامل آنان یا اشخاص مرتبط با آنها که به موجب این قرارداد به اطلاعات محرمانه دسترسی دارند از طبیعت محرمانه این اطلاعات مطلع هستند و لازم است تا از شروط طرفین قرارداد پیروی نمایند بنابراین طرفی که اطلاعات را دریافت می نماید مسئول است که تضمین نماید تعهد رعایت محرمانگی و عدم استفاده مندرج در این ماده را به دقت رعایت می‌کند و در مقابل فعل یا ترک فعل کارکنان نمایندگان یا عوامل خود کاملا مسئول فرض می گردد.</span><br/><br/>
                        <span>13-3 هرگونه افشا و انتشار بدون مجوز این اطلاعات قابل تعقیب کیفری در مراجع قانونی و مطالبه خسارت در مرجع داوری این قرارداد است.  مبلغ خسارت مذکور طی داوری تعیین خواهد شد.</span><br/><br/>
                        <span>تبصره: اطلاعاتی که در اختیار عموم قرار دارند جزو اطلاعات محرمانه محسوب نمی گردد.</span><br/><br/>
                        <span><b>ماده 14:فورس ماژور</b></span><br/><br/>
                        <span>14-1 منظور از فورس ماژور در این قرارداد هرگونه حادثه و پیشامد غیرقابل پیش بینی، غیر قابل دفع و خارج از اراده و کنترل طرفین است. اعم از جنگ، بلایای طبیعی، آتش‌سوزی، اعتصاب ، تغییر قوانین و مقررات یا تعطیلی ادارات و نهادهای دولتی برای مدت بیش از یک هفته که به واسطه آن طرفی که در چنین شرایطی قرار گرفته است نمی تواند تمام یا بخشی از تعهدات خود، موضوع این قرارداد یاد قوانین مرتبط را ایفا نماید.</span><br/><br/>
                        <span>14-2 متعهد در صورتی از ایفای تعهدات در اثر فورس ماژور معاف می گردد که حداکثر تا  1 روز پس از اطلاع از چنین وضعیتی مراتب را ً به اطلاع طرف دیگر رسانیده باشد.
                        </span><br/><br/>

                    </p>
                    <p id="step1S10" v-if="pageStep === 10">
                        <span><b>ماده 15: ابلاغات</b></span><br/><br/>
                        <span>کلیه اختلافات و دعاوی ناشی از این قرارداد و یا راجع به آن از جمله انعقاد، اعتبار، فسخ ،تفسیر یا اجرای آن به مرکز داوری اتاق بازرگانی صنایع معادن و کشاورزی شیراز ارجاع می گردد. که مطابق با قانون اساسنامه و آیین داوری آن مرکز با رای یک یا سه نفر داور به صورت قطعی و لازم الاجرا حل و فصل می گردد. داور/ان علاوه بر مقررات حاکم عرف تجارتی ذیربط را نیز مراعات خواهند نمود. شرط داوری حاضر موافقتنامه مستقل از قرارداد اصلی تلقی می‌شود و در هر حال لازم الاجرا است.</span><br/><br/>
                        <span><b>ماده 16:حل وفصل اختلافات و داوری</b></span><br/><br/>
                        <span>کلیه اختلافات و دعاوی ناشی از این قرارداد و یا راجع به آن از جمله انعقاد، اعتبار، فسخ ،تفسیر یا اجرای آن به مرکز داوری اتاق بازرگانی صنایع معادن و کشاورزی شیراز ارجاع می گردد. که مطابق با قانون اساسنامه و آیین داوری آن مرکز با رای یک یا سه نفر داور به صورت قطعی و لازم الاجرا حل و فصل می گردد. داور/ان علاوه بر مقررات حاکم عرف تجارتی ذیربط را نیز مراعات خواهند نمود. شرط داوری حاضر موافقتنامه مستقل از قرارداد اصلی تلقی می‌شود و در هر حال لازم الاجرا است.</span><br/><br/>
                        <span><b>ماده 17: نسخ قرارداد</b></span><br/><br/>
                        <span>قرارداد حاضر در 17 ماده و پیوست های آن (اجزای لاینفک قرارداد) در یک نسخه الکترونیکی تهیه و تنظیم گردیده است و در راستای تایید مفاد آن به تایید الکترونیکی طرف دوم (که به منزله قبول و تایید و امضای حضوری وی می باشد) رسید.</span><br/><br/>
                        <span>
 بنا به مراتب فوق طرفین، قرارداد حاضر را از تاریخ درج شده در آن اجرایی نمودند. تمام/</span><br/><br/>
                    </p>

                </div>
            </div>
        </div>
    </section>
</template>

<script>
    import {eventBus} from "../../../../router/router";

    export default {
        data:function(){
            return{
                pageStep:1,
                errors:'',
                popUpMsg:'',
                submiting:false,
                contractConfirmed:false,
                currentUser:{
                    user_info:'',
                    profile:''
                },
                items: [
                    {
                        message: 'قرارداد',
                        url: 'profileContract',
                    },
                    {
                        message: ' اطلاعات تکمیلی',
                        url: 'complementary',
                    },
                    {
                        message: 'اطلاعات پایه',
                        url: 'profileBasic',
                    }
                ],
            }
        },
        methods:{
            init:function(){
                var self = this;

                axios.post('/user/profile_info')
                    .then(function(response){
                        self.currentUser = response.data;
                        self.contractConfirmed = response.data.user_info.contract_confirmed;
                    });
            },
            confirmContract:function(){
                var self = this;

                if(this.contractConfirmed == false){
                    axios.post('/confirm_initial_contract')
                        .then(function(response){
                            if(response.status == 200){
                                self.popUpMsg = 'تایید قرار داد با موفقیت انجام شد.';
                                eventBus.$emit('submitSuccess',self.popUpMsg);

                                $('#custom-main-modal').modal('show');
                            }
                            else if(response.status == 500){
                                alert('failed');
                            }
                        });
                }
                else{
                    this.popUpMsg = 'شما قبلا این قرار داد را پذیرفته اید.';
                    eventBus.$emit('submitSuccess',self.popUpMsg);
                    $('#custom-main-modal').modal('show');
                }
            },
            goToNextPage: function(){
                if (this.pageStep < 10){
                    this.pageStep++;
                }
            },
            goToPrePage: function(){
                if (this.pageStep < 1){
                    this.pageStep = 1;
                }else if (this.pageStep > 1){
                    this.pageStep--;
                }
            },
        },
        mounted(){
            this.init();
            eventBus.$emit('subHeader', this.items);
        },
    }

</script>

